app/controllers/words_controller.rb

    def index
        @poke = Word.last&.created_at&.today? ? Word.last : refresh
---
INSERT INTO "words" ("pokename", "poketype", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pokename", "mewtwo"], ["poketype", "[\"psychic\"]"], ["created_at", "2022-06-09 17:22:07.018369"], ["updated_at", "2022-06-09 17:22:07.018369"]]
SELECT "words".* FROM "words" ORDER BY "words"."id" DESC LIMIT ?  [["LIMIT", 1]]

    def refresh
        poke = generate_pokemon
        last_20 = Word.last(20).pluck(:name)
        while last_20.include?(poke[:name]) || !poke[:name].index( /[^[:alnum:]]/ ).nil?
            poke = generate_pokemon
        end
        new_pokemon = Word.new(pokename: poke[:name], poketype: poke[:type])
        new_pokemon.save
---
SELECT "words".* FROM "words" ORDER BY "words"."id" DESC LIMIT ?  [["LIMIT", 20]]
INSERT INTO "words" ("pokename", "poketype", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pokename", "mr-mime"], ["poketype", "psychic,fairy"], ["created_at", "2022-06-28 13:46:27.793921"], ["updated_at", "2022-06-28 13:46:27.793921"]]