app/controllers/words_controller.rb

INSERT INTO "words" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "rattata"], ["created_at", "2022-06-08 16:20:54.119257"], ["updated_at", "2022-06-08 16:20:54.119257"]]
---
    def refresh
        number = generate_number
        word = fetch_pokemon(number)
        new_pokemon = Word.new(name: word)
        new_pokemon.save